"""
File with task 5
"""

def task_5():
    """
    Напишите программу, которая принимает на вход координаты двух
    точек и находит расстояние между ними в 2D пространстве.
    """
    print(task_5.__name__)
    x_1 = float(input('Введите x1: '))
    y_1 = float(input('Введите y1: '))
    x_2 = float(input('Введите x2: '))
    y_2 = float(input('Введите y2: '))
    dist = ((x_1 - x_2) ** 2 + (y_1 - y_2) ** 2) ** 0.5
    print(round(dist, 3))
    print('----------------')
